БухЭксп/InformationRegisters/CW_ПараметрыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Пользователи</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПраваДоступаДляПараметровМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПраваДоступаДляПараметровМониторинга</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/CW_ПраваДоступа_ПИ/Ext/Module.bsl
Функция ГруппаПользователя(Пользователь) Экспорт 
	// --- 
	//Попытка
	//	// проверяем, нет ли у него полных прав
	//	ИП = Пользователь.ИдентификаторПользователяИБ;
	//	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИП);
	//	Если ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава) Тогда
	//		Возврат(Справочники.CW_ГруппыПользователей.Администраторы);
	//	КонецЕсли; 
	//Исключение
	//КонецПопытки;
	
	Если CW_ПраваДоступа.ЭтоПолноправныйПользователь(Пользователь,Истина) Тогда
		Возврат Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли;
	
	//полных прав нет, проеряем группу пользователя
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПараметрыПользователей.Группа
	|ИЗ
	|	РегистрСведений.CW_ПараметрыПользователей КАК CW_ПараметрыПользователей
	|ГДЕ
	|	CW_ПараметрыПользователей.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			 Возврат Выборка.Группа;
		КонецЕсли;
	КонецЕсли; 
	
	//Пользователь не включен ни в одну группу!!!
	Возврат(Справочники.CW_ГруппыПользователей.ПустаяСсылка());
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

Функция ПраваПараметровДляГруппы(ГруппаПользователя) Экспорт 
	
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь,Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Параметр,
	               |	CW_ПараметрыГрузоперевозок.Идентификатор КАК Идентификатор,
	               |	ВЫБОР
	               |		КОГДА CW_ПараметрыГрузоперевозок.НеПоказыватьВФормеГрузоперевозок
	               |			ТОГДА &ЭтоПолноправныйПользователь
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА &ПолныеПрава
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Просмотр, ЛОЖЬ)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Просмотр,
	               |	ВЫБОР
	               |		КОГДА CW_ПараметрыГрузоперевозок.НеПоказыватьВФормеГрузоперевозок
	               |			ТОГДА &ЭтоПолноправныйПользователь
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА &ПолныеПрава
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Редактирование, ЛОЖЬ)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Редактирование
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
	               |		ПО (CW_ПраваДоступаДляПараметровМониторинга.Параметр = CW_ПараметрыГрузоперевозок.Ссылка)
	               |			И (CW_ПраваДоступаДляПараметровМониторинга.Группа = &Группа)
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.Предопределенный = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Группа"						, ГруппаПользователя);
	Запрос.УстановитьПараметр("ПолныеПрава"					, ГруппаПользователя.ПолныеПрава);
	Запрос.УстановитьПараметр("ЭтоПолноправныйПользователь"	, ЭтоПолноправныйПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураОтвета = Новый Структура;	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПравПараметра = Новый Структура("Идентификатор,Просмотр,Редактирование","",Ложь,Ложь); 
		ЗаполнитьЗначенияСвойств(СтруктураПравПараметра,Выборка);
		
		СтруктураОтвета.Вставить("п_"+_сф.КлючПоСсылке(Выборка.Параметр), СтруктураПравПараметра);
		
	КонецЦикла; 
	
	Возврат СтруктураОтвета;
	
КонецФункции
